service/src/test/resources/ws-samplexml/subscriberservice20_getSubsProfile.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sub="http://soa.o2.co.uk/subscriberdata_2"
    xmlns:cor="http://soa.o2.co.uk/coredata_1" 
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" 
    xmlns:mtd="http://soa.o2.co.uk/managepostpaytariffdata_2"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
>
    <soapenv:Header>
        <wsse:Security>
            <wsse:UsernameToken>
                <wsse:Username>musicQubed_1001</wsse:Username>
                <wsse:Password>XXX</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
        <cor:SOAConsumerTransactionID>201306261618:musicqubed.london.test</cor:SOAConsumerTransactionID>
    </soapenv:Header>
   <soapenv:Body>
      <sub:getSubscriberProfile>
         <sub:subscriberID>?</sub:subscriberID>
      </sub:getSubscriberProfile>
   </soapenv:Body>
</soapenv:Envelope>